[{"title":"Product Hunt launches beta of YourStack, a home for your favorite things","description":"The team behind Product Hunt is launching a new social network called YourStack, a platform aiming to connect people that are passionate about products and help them discover what things their frie...","link":"/2020/01/28/product-hunt-launches-beta-of-yourstack-a-home-for-your-favorite-things/"},{"title":"Essential advice for securing your small startup","description":"Jeff Bezos’ phone was hacked. And if the richest person in the world is vulnerable, chances are good that your startup could get hacked, too. The good news is that, as a tiny company, you’re not a ...","link":"/2020/01/28/some-essential-advice-to-secure-your-small-startup/"},{"title":"Free Agency wants to give every tech worker a career and salary boost","description":"Labor markets, particularly those in the tech industry, are incredibly lopsided against employees. Companies screen, interview, and negotiate with thousands of candidates per year, while employees ...","link":"/2020/01/28/free-agency-wants-to-give-every-tech-worker-a-career-and-salary-boost/"},{"title":"Just released: Last round of tickets to 3rd Annual Winter Party at Galvanize","description":"If parties came with an alert system, this post would qualify as Def Con 4. Now hear this — we just released the final batch of tickets to our 3rd Annual Winter Party at Galvanize, which heats up o...","link":"/2020/01/28/just-released-last-round-of-tickets-to-3rd-annual-winter-party-at-galvanize/"},{"title":"Securiti.ai scores $50M Series B to modernize data governance","description":"Securiti.ai, a San Jose startup, is working to bring a modern twist to data governance and security. Today the company announced a $50 million Series B led by General Catalyst, with participation f...","link":"/2020/01/28/securiti-ai-scores-50m-series-b-to-modernize-data-governance/"},{"title":"72 hours left to save $150 on tickets to TC Sessions: Robotics + AI 2020","description":"We’re counting the days (35 to be precise) until TC Sessions: Robotics + AI 2020 takes place on March 3 in Berkeley, Calif. But we’re also counting the days that you can save on the price of admiss...","link":"/2020/01/28/72-hours-left-to-save-150-on-tickets-to-tc-sessions-robotics-ai-2020/"},{"title":"Kepler will build its small satellites at a new manufacturing facility in Toronto","description":"Satellite communications startup Kepler will manufacture its small satellites going forward at a new 5,000-square-foot facility in Toronto, Ontario, Canada . The company is working with partners, i...","link":"/2020/01/28/kepler-will-build-its-small-satellites-at-a-new-manufacturing-facility-in-toronto/"},{"title":"ServiceNow acquires conversational AI startup Passage AI","description":"ServiceNow announced this morning that it has acquired Passage AI, a startup that helps customers build chatbots in multiple languages, something that should come in handy as ServiceNow continues t...","link":"/2020/01/28/servicenow-acquires-conversational-ai-startup-passage-ai/"},{"title":"Directly nabs $20M led by Samsung to help make customer service chatbots more intelligent, adds new CEO","description":"Chatbots have had a patchy track record in the world of tech, where early efforts not only failed to deliver on the magical idea of a computer producing the exact answers you were looking for in a ...","link":"/2020/01/28/directly-nabs-20m-led-by-samsung-to-help-make-customer-service-chatbots-more-intelligent-adds-new-ceo/"},{"title":"Scroll launches its subscription offering ad-free access across 300 partner sites","description":"After a long period of invite-only beta testing, Scroll is officially launching today, offering ad-free access to sites like BuzzFeed News, Business Insider, Salon, Slate and Vox for an introductor...","link":"/2020/01/28/scroll-launch/"},{"title":"With Tony Fadell’s help, Advano is building battery components to power an electric future","description":"Using scrap silicon as its feedstock, a New Orleans-based company called Advano has raised $18.5 million to manufacture battery components to enable more powerful, smaller and longer-lasting batter...","link":"/2020/01/28/with-tony-fadells-help-advano-is-building-battery-components-to-power-an-electric-future/"},{"title":"Cooks Venture raises $4 million from Golden West Food Group to ramp up distribution","description":"Cooks Venture, the agtech company looking to revolutionize the chicken industry, has today announced the close of a $4 million funding round led by Golden West Food Group. Cooks Venture has been wo...","link":"/2020/01/28/cooks-venture-raises-4-million-from-golden-west-food-group-to-ramp-up-distribution/"},{"title":"Pecan.ai launches with $11M Series A to automate machine learning","description":"Pecan.ai, a startup that wants to help business analysts build machine learning models in an automated fashion, emerged from stealth today and announced an $11 million Series A. The round was led b...","link":"/2020/01/28/pecan-ai-launches-with-11m-series-a-to-automate-machine-learning/"},{"title":"Frontify raises $22.3M to help businesses manage how their brands and logos get used","description":"The rise of design tools like Canva and the vast expanse of digital spaces where a company’s name can appear these days have created a challenge for organisations: how best to make sure that ...","link":"/2020/01/28/frontify-raises-22-3m-to-help-businesses-manage-how-their-brands-and-logos-get-used/"},{"title":"Chicago’s ActiveCampaign raises $100M for an all-in-one marketing and sales automation platform","description":"Marketing and sales automation — tools that leverage the advances and data of our digital age to better identify and then interact with customers — is big business, with the whole marke...","link":"/2020/01/28/chicagos-activecampaign-raises-100m-for-an-all-in-one-marketing-and-sales-automation-platform/"},{"title":"Shipamax scores $7M Series A to digitise the logistics back-office","description":"Shipamax, the London-based startup and YC graduate that is helping freight forwarders and other logistics companies automate their back-office processes, has raised $7 million. Leading the round is...","link":"/2020/01/28/when-a-pivot-comes-together/"},{"title":"India’s InterviewBit secures $20M to grow its advanced online computer science program","description":"InterviewBit, a Bangalore-based startup that runs an advanced online computer science program for college graduates and young professional engineers, has raised $20 million in one of the largest Se...","link":"/2020/01/27/interviewbit-secures-20m-to-grow-its-advanced-online-computer-science-program-in-india/"},{"title":"ManoMano raises $139 million for its home improvement e-commerce platform","description":"French startup ManoMano is raising another mega round of funding. The company operates an e-commerce website for DIY, home improvement and gardening products. This time, ManoMano is raising $139 mi...","link":"/2020/01/27/manomano-raises-139-million-for-its-home-improvement-e-commerce-platform/"},{"title":"H1 Insights is giving the healthcare industry the ultimate professional database","description":"“I want to build a business which profiles every single researcher and healthcare professional in the world and I want to sell it to industry,” says Ariel Katz, the co-founder and chief...","link":"/2020/01/27/h1-insights-is-giving-the-healthcare-industry-the-ultimate-professional-database/"},{"title":"NASA taps startup Axiom Space for the first habitable commercial module for the Space Station","description":"NASA has selected Houston-based Axiom Space, a startup founded in 2016, to build the first commercial habitat module for the International Space Station (ISS). This module will be used as a destina...","link":"/2020/01/27/nasa-taps-startup-axiom-space-for-the-first-habitable-commercial-module-for-the-space-station/"}]